spec/fixtures/vcr_cassettes/ChartMogul_Invoice/API_Actions/destroys_the_invoice_correctly_with_instance_method.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.chartmogul.com/v1/invoices/inv_c183cce8-a9f4-4992-b2d0-f42e16309866
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/3.3.1
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 200
      message: OK
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - max-age=0, private, must-revalidate
      content-encoding:
      - gzip
      content-type:
      - application/json; charset=utf-8
      date:
      - Mon, 30 Oct 2023 03:26:02 GMT
      etag:
      - W/"c162edda5a91257bffe9a1b3b10e4762"
      referrer-policy:
      - strict-origin-when-cross-origin
      vary:
      - Accept-Encoding, Accept-Encoding
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - fd33ebf73936202f9887ec959a6c46e8
      x-runtime:
      - '0.058600'
      x-xss-protection:
      - 1; mode=block
      content-length:
      - '451'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"uuid":"inv_c183cce8-a9f4-4992-b2d0-f42e16309866","date":"2023-07-26T23:00:00.000Z","due_date":"2023-07-26T23:00:00.000Z","errors":{},"external_id":"1","currency":"EUR","customer_uuid":"cus_1245b3b0-2c82-11ee-aef1-93c289e29cdb","line_items":[{"uuid":"li_5d8424c3-4089-4e7f-a7b3-67f38fb35de9","external_id":null,"type":"one_time","description":null,"amount_in_cents":11100,"quantity":1,"discount_code":"","discount_amount_in_cents":0,"tax_amount_in_cents":0,"transaction_fees_in_cents":0,"account_code":"","transaction_fees_currency":null,"discount_description":null,"event_order":null}],"transactions":[{"uuid":"tr_49973871-fc39-4fd9-8c68-6c0721b9543e","external_id":null,"amount_in_cents":11100,"type":"payment","date":"2023-07-26T23:00:00.000Z","result":"successful","transaction_fees_in_cents":null,"transaction_fees_currency":null},{"uuid":"tr_15dcd1f9-6d0f-4791-bd68-2829007eb74e","external_id":null,"amount_in_cents":11100,"type":"refund","date":"2023-07-26T23:00:00.000Z","result":"successful","transaction_fees_in_cents":null,"transaction_fees_currency":null}]}'
    http_version:
  recorded_at: Mon, 30 Oct 2023 03:26:01 GMT
- request:
    method: delete
    uri: https://api.chartmogul.com/v1/invoices/inv_c183cce8-a9f4-4992-b2d0-f42e16309866
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/3.3.1
      Authorization:
      - Basic hidden
  response:
    status:
      code: 204
      message: No Content
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - no-cache
      date:
      - Mon, 30 Oct 2023 03:26:02 GMT
      referrer-policy:
      - strict-origin-when-cross-origin
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - 7a44dd2d1c76c94f691ea5edfdd4cafa
      x-runtime:
      - '0.130862'
      x-xss-protection:
      - 1; mode=block
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: ''
    http_version:
  recorded_at: Mon, 30 Oct 2023 03:26:02 GMT
recorded_with: VCR 5.1.0
